charliermarsh.ruff
christian-kohler.path-intellisense
cschlosser.doxdocgen
eamodio.gitlens
github.remotehub
github.vscode-pull-request-github
jeff-hykin.better-cpp-syntax
kevinrose.vsc-python-indent
mhutchie.git-graph
mohsen1.prettify-json
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
njpwerner.autodocstring
ranch-hand-robotics.rde-pack
ranch-hand-robotics.rde-ros-2
ranch-hand-robotics.urdf-editor
redhat.vscode-xml
shd101wyy.markdown-preview-enhanced\
streetsidesoftware.code-spell-checker